#+TITLE: CARRA WorkBook - Greenland (GAP FILLING)
#+AUTHOR: Ken Mankoff
#+EMAIL: kdm@geus.dk
#+DATE: {{{time(%Y-%m-%d)}}}

#+PROPERTY: header-args:sh :tangle-mode (identity #o755) :shebang "#!/bin/bash" :comments org

** Requirements

+ A =lon.csv= and =lat.csv= file containing the locations of the data. These files are simply columns of data. Example:

#+BEGIN_SRC sh :results verbatim
head lon.csv
#+END_SRC
#+RESULTS:
#+begin_example
     -120.355
     -120.318
     -120.280
     -120.243
     -120.206
     -120.168
     -120.131
     -120.094
     -120.056
     -120.019
#+end_example

+ Data files, located anywhere, but then in folders and named <year>/<year>_<doy>.txt. For example, here we use =./input/=, and then the required sub-folders and file names. Example:

#+BEGIN_SRC sh :results verbatim
find ./input/ | head -n15
#+END_SRC
#+RESULTS:
#+begin_example
./input/
./input//2015
./input//2015/2015_093.txt
./input//2015/2015_094.txt
./input//2015/2015_095.txt
./input//2015/2015_096.txt
./input//2015/2015_097.txt
./input//2015/2015_098.txt
./input//2016
./input//2016/2016_060.txt
./input//2016/2016_061.txt
./input//2016/2016_062.txt
./input//2016/2016_063.txt
./input//2016/2016_064.txt
./input//2016/2016_065.txt
#+end_example

+ The GNU =parallel= utility.

#+BEGIN_SRC sh :results verbatim
parallel --version
#+END_SRC
#+RESULTS:
#+begin_example
GNU parallel 20180522
Copyright (C) 2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
Ole Tange and Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
GNU parallel comes with no warranty.

Web site: http://www.gnu.org/software/parallel

When using programs that use GNU Parallel to process data for publication
please cite as described in 'parallel --citation'.
#+end_example

+ The BedMachine v3 data set in the current folder (symlink is fine)

#+BEGIN_SRC sh :results verbatim
ln -s ~/data/Greenland/Morlighem_2017/BedMachineGreenland-2017-09-20.nc 
ls -l ./BedMachineGreenland-2017-09-20.nc 
#+END_SRC

#+RESULTS:
: lrwxr-xr-x  1 kdm  staff  74 Jul 11 12:05 ./BedMachineGreenland-2017-09-20.nc -> /Users/kdm/data/Greenland/Morlighem_2017/BedMachineGreenland-2017-09-20.nc


